<template>
    <div>
        <van-nav-bar title="服务协议" left-arrow @click-left="onGoBack"></van-nav-bar>
        <van-swipe>
            <van-swipe-item>
                <img width="100%" src="@/assets/contactUs.png"/>
            </van-swipe-item>
        </van-swipe>
        <van-collapse v-model="activeNames">
            <van-collapse-item title="服务协议" name="1">
                成都市艾特睿医药科技有限公司（以下简称“艾特睿医药”、“我们”）深知用户信息安全与隐私保护的重要性，我们将采取安全保护措施，致力于提升信息处理透明度，保障您的个人信息安全可控。
                艾特睿医药将严格遵守法律法规并遵循以下用户信息及隐私保护原则，为您提供安全、可靠的服务：
                1、合理必要：为了向您提供更好的服务，我们仅收集必要的信息。这些信息的收集将用于为您提供适合的解决方案和服务。
                2、充分知情：我们努力使用简明易懂的表述，向您陈述用户信息及隐私保护政策，以便您清晰地了解我们的信息处理方式，您可以自由决定是否向领募医药相关工作人员提供相关信息。
                3、安全可靠：我们竭尽全力通过合理有效的信息安全技术及管理流程，防止您的信息泄露、损毁、滥用。我们在服务流程的各个环节，融入隐私保护的理念。 在使用艾特睿医药的各项服务前，希望您务必仔细阅读并透彻理解本《用户信息及隐私保护政策》（以下简称“政策”），详细了解我们对信息的收集、使用方式，以便您更好地了解我们的服务并作出适当的选择,在您确认充分理解并同意该等政策后方可使用相关服务。若您开始使用艾特睿医药之相关服务，即被视为您对本政策所述内容的接受和认可。
                定义艾特睿医药，是指成都市艾特睿医药科技有限公司。
                艾特睿医药平台，是指艾特睿医药网站（www.aiteruiyiyao.cn）、“爱之募”微信公众号等网站及客户端程序。
                个人信息，是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。如姓名、出生日期、身份证件号码、个人生物识别信息、住址、通信通讯联系方式、通信记录和内容、账号密码、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息等。
                删除个人信息，是指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。
                本政策将主要向您说明并帮助您了解：
                一、我们可能收集的信息；
                二、我们如何收集和使用您的个人信息；
                三、我们如何共享、转让、公开披露您的个人信息；
                四、我们如何保护您的个人信息；
                五、您如何管理您的个人信息；
                六、我们如何处理未成年人的个人信息；
                七、您的个人信息如何在全球范围转移；
                八、本政策如何更新；
                九、如何联系我们。 
                一、我们可能收集的信息我们在提供服务时，根据合法、正当、必要的原则，仅可能收集、储存、和使用为您提供服务所必要的下列与个人（“您”）有关的信息：
                1.与个人身份相关的信息：
                当您使用服务时，我们可能收集、汇总或要求您提供的与个人身份相关的信息。例如，您的姓名、生日、年龄、性别、住址、身份证号、电话号码、电子邮箱地址、微信号、用户名、IP地址、个人位置信息、用户的设备信息等；您在使用服务时提交的个人健康信息，例如病历病史资料、检查报告、手术及麻醉记录、护理记录、药物食物过敏信息、生育信息、诊治情况、家族病史、其他与个人身体健康状况相关的信息，如体重、身高肺活量等，以及；您通过我们的客服或参加我们举办的活动时所提交的个人信息。
                2.与个人身份无关的信息：
                当您使用服务时，我们将可能自动收集、获取并存储为服务日志的信息，例如来源途径、访问顺序、停留时间以及电子日志信息等。
                3.其他基于为您提供服务需要而收集或汇总的您的信息：
                例如，其他用户分享的信息中含有您的信息、推荐您参加活动的信息等。
                二、我们如何收集和使用您的个人信息我们严格遵守法律法规的规定及与用户的约定，出于以下目的，收集、储存和使用您的个人信息。若我们超出以下用途或者将基于特定目的收集而来的信息用于其他目的使用您的信息，我们将再次向您进行说明，并征得您的同意。
                1.帮助您成为我们的用户。
                2.向您提供服务或产品。
                3.向您展示并推荐您可能感兴趣的资讯、活动等相关信息和服务。
                4.邀请您参与有关我们服务的调查，评估、改善我们的服务及推广活动的效果。
                5.将所收集到的信息用于数据分析。例如，我们将收集到的信息用于分析形成不包含任何个人信息的行业洞察报告。
                6.为您提供安全保障。
                7.征得授权同意的例外：
                以下情形中收集您的个人信息无需征得您的授权同意：
                •与国家安全、国防安全有关的；
                •与公共安全、公共卫生、重大公共利益有关的；
                •与犯罪侦查、起诉、审判和判决执行等有关的；
                •出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
                •所收集的个人信息是您自行向社会公众公开的；
                •从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
                •根据您的要求签订合同所必需的；
                •用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
                •为合法的新闻报道所必需的；
                •学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
                •法律法规规定的其他情形。
                三、我们如何共享、转让、公开披露您的个人信息1.共享：
                我们不会向除服务提供者以外的任何公司、组织和个人分享您的信息，但以下情况除外：
                •在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息；
                •我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息；
                •与授权合作伙伴共享：仅为实现本政策中所声明之目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。
                2.转让：
                我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
                •在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息。
                3.公开披露
                我们仅会在以下情况下，公开披露您的个人信息：
                •获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；
                •如果我们确定您出现违反法律法规或严重违反艾特睿医药相关协议规则的情况，或为保护艾特睿医药及用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或艾特睿医药相关协议规则征得您同意的情况下披露关于您的个人信息。
                4.共享、转让、公开披露个人信息时事先征得授权同意的例外：
                •与国家安全、国防安全有关的；
                •与公共安全、公共卫生、重大公共利益有关的；
                •与犯罪侦查、起诉、审判和判决执行等有关的；
                •出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
                •您自行向社会公众公开的个人信息；
                •从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
                四、我们如何保护您的个人信息1.我们已采取符合业界标准、合理可行的安全防护措施保护您提供的个人信息安全，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。
                2.我们会采取合理可行的措施，尽力避免收集无关的个人信息。
                3.我们将在合理的安全水平内使用各种安全保护措施以保障信息的安全。例如，我们使用加密技术（例如，TLS、SSL）、匿名化处理等手段来保护您的个人信息。
                4.我们建立专门的管理制度、流程和组织确保信息安全。例如，我们严格限制访问信息的人员范围，要求他们遵守保密义务，并进行审查。
                五、您如何管理您的个人信息1.您可以在使用我们服务的过程中，访问、修改、补充和删除您提供的注册信息和其他个人信息，也可按照通知指引与我们联系。您访问、修改、补充和删除个人信息的范围和方式将取决于您使用的具体服务。
                2.我们将按照本政策所述，仅为实现我们产品或服务的功能，收集、使用您的信息。如您发现我们违反法律、行政法规的规定或者双方的约定收集、使用您的个人信息，您可以要求我们删除。如您发现我们收集、存储的您的个人信息有错误的，您也可以要求我们更正。请通过本政策列明的联系方式与我们联系。
                3.响应您的请求：
                对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。
                4.响应您请求的例外：
                在以下情形中，我们将无法响应您的请求：
                •与国家安全、国防安全有关的；
                •与公共安全、公共卫生、重大公共利益有关的；
                •与犯罪侦查、起诉、审判和执行判决等有关的；
                •有充分证据表明个人信息主体存在主观恶意或滥用权利的；
                •响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
                •涉及商业秘密的。
                六、我们如何处理未成年人的个人信息1.如您为未成年人的，建议您请您的父母或监护人仔细阅读本政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。
                2.对于经父母或监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。
                七、本政策如何更新我们可能适时修订本政策内容。如该等变更会导致您在本政策项下权利的实质减损，我们将在变更生效前，通过在页面显著位置提示、向您发送电子邮件等方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的政策约束。八、如何联系我们如您对本政策或其他相关事宜有疑问、意见或建议，请通过客服电话028-68517858与我们联系。您也可将您的问题发送至-----------或寄往如下地址：成都市天府大道孵化园1号楼B座5-21号，成都市艾特睿医药科技有限公司收，邮编：610000。我们将尽快审核所涉问题，并在验证您的用户身份后的三十个工作日内予以回复。 
                我已阅读并理解上述《用户信息及隐私保护政策》，并授权艾特睿医药收集、整理、记录我的个人信息并为我提供服务。
            </van-collapse-item>
        </van-collapse>

    </div>
</template>

<script>
  import {NavBar, Swipe, SwipeItem, Collapse, CollapseItem} from 'vant';

  export default {
    components: {
      [NavBar.name]: NavBar,
      [Swipe.name]: Swipe,
      [SwipeItem.name]: SwipeItem,
      [Collapse.name]: Collapse,
      [CollapseItem.name]: CollapseItem,
    },
    data: function () {
      return {
        activeNames: ['1']
      }
    },
    methods: {
      onGoBack: function () {
        let redirectURL = this.$route.query.redirectURL;
        this.$router.push({path: redirectURL});
      }
    }
  }
</script>
